# Brewfile - managed declaratively with `brew bundle`

# Core CLI tools
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-sed"

# Shell
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "starship"

# Modern CLI replacements
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "zoxide"
brew "git-delta"
brew "tldr"
brew "jq"
brew "yq"
brew "tree"

# Git
brew "git"
brew "gh"

# Development
brew "mise"
brew "tmux"
brew "curl"
brew "wget"

# Libraries
brew "libxml2"
brew "libxslt"
brew "python@3"

# Mac App Store CLI
brew "mas"

# Cask applications
cask "alfred"
cask "iterm2"
cask "sublime-text"
cask "spotify"
cask "whatsapp"
